## <문제>
## 아래 문제를 해결하여 "pandas_성명.ipynb" 파일에 저장하여 제출하세요.  
## 온라인 학습활동 과제 6. 데이터분석 라이브러리 pandas 연습

### 빅데이터전공 20175327 이연희

### 1) 
### datamining5_pandas.ipynb 학습하면서 이해안되는 부분에 대한 질문 3개이상 마크다운으로 만들기

질문 1. 
데이터프레임을 생성할때 List, Series, dict 등등의 방법이 많은데 어떤 경우에 각 방법을 사용하는게 좋은지 궁금합니다.

질문 2. 구조체 배열은 2차원 numpy ndarray로 DataFrame을 작성할시 왜 완벽하게 동작하지 않는지 궁금합니다.

질문 3. pandas에서 행을 선택하는 인덱싱 방법이 많은데 버전마다 행을 인덱싱하는 방법이 달라지는 이유가 궁금합니다.

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

### 2) 
### datamining5_pandas.ipynb안에 제공되는 실습문제 1, 2, 3을 해결하기

### 실습 #1. Series 연습
1. 10명의 점수를 series로 생성 (점수 범위: 0~100), 인덱스는 1번부터 순차로 부여
2. 1번부터 3번까지 추출
3. 평균, 최대, 최소값 확인
4. 평균보다 작은 점수만 추출
5. 점수가 큰순서로 정렬

1. 10명의 점수를 series로 생성 (점수 범위: 0~100), 인덱스는 1번부터 순차로 부여

In [24]:
person=pd.Series([100,85,76,92,67,52,80,63,29,97],index=[1,2,3,4,5,6,7,8,9,10])
display("10명의 점수",person)

'10명의 점수'

1     100
2      85
3      76
4      92
5      67
6      52
7      80
8      63
9      29
10     97
dtype: int64

2. 1번부터 3번까지 추출

In [25]:
display("1번부터 3번까지 추출",person[:3])

'1번부터 3번까지 추출'

1    100
2     85
3     76
dtype: int64

3. 평균, 최대, 최소값 확인

In [26]:
print("평균 :",person.mean())
print("최대값 :",person.max())
print("최소값 :",person.min())

평균 : 74.1
최대값 : 100
최소값 : 29

4. 평균보다 작은 점수만 추출

In [27]:
display("평균보다 작은 점수 추출",person[person<person.mean()])

'평균보다 작은 점수만 추출'

5    67
6    52
8    63
9    29
dtype: int64

5. 점수가 큰순서로 정렬

In [87]:
a=pd.Series(person)
a1=a.sort_values(ascending=False)
display("점수가 큰순서로 정렬",a1)

'점수가 큰순서로 정렬'

1     100
10     97
4      92
2      85
7      80
3      76
5      67
8      63
6      52
9      29
dtype: int64

### 실습 #2. 데이터프레임 생성 연습

1) 5명의 성적 데이터 생성 (성명, 입학년도, 학점(0~4.5), 성별(M,F))  
열 : Name, Adyear, grade, sex    
행인덱스 : 순번   
2) 인덱스, 칼럼, 값들, 데이터타입 확인  
3)통계요약 확인  
4)성명순으로 정렬

1) 5명의 성적 데이터 생성 (성명, 입학년도, 학점(0~4.5), 성별(M,F))  
열 : Name, Adyear, grade, sex  
행인덱스 : 순번

In [73]:
grade=['1','2','3','4','5']
df=pd.DataFrame({"Name": pd.Series(['Lee','Kim','Jung','Kim','Choi']),
                "Adyear":pd.Series([2017,2018,2019,2016,2020]),
                "Grade":pd.Series([4.3,3.7,3.2,2.9,3.9]),
                "Sex":pd.Series(['F','M','F','F','M'])})
df.index=grade
display(df)

   Name  Adyear  Grade Sex
1   Lee    2017    4.3   F
2   Kim    2018    3.7   M
3  Jung    2019    3.2   F
4   Kim    2016    2.9   F
5  Choi    2020    3.9   M

2) 인덱스, 칼럼, 값들, 데이터타입 확인

In [74]:
print("인덱스 확인 :",df.index)
print("\n칼럼 확인 :",df.columns)
print("\n값들 확인 :\n",df.values)
print("\n데이터타입 확인 :\n",df.dtypes)

인덱스 확인 : Index(['1', '2', '3', '4', '5'], dtype='object')

칼럼 확인 : Index(['Name', 'Adyear', 'Grade', 'Sex'], dtype='object')

값들 확인 :
 [['Lee' 2017 4.3 'F']
 ['Kim' 2018 3.7 'M']
 ['Jung' 2019 3.2 'F']
 ['Kim' 2016 2.9 'F']
 ['Choi' 2020 3.9 'M']]

데이터타입 확인 :
 Name       object
Adyear      int64
Grade     float64
Sex        object
dtype: object

3) 통계요약 확인

In [75]:
print("통계요약 확인 :\n",df.describe())

통계요약 확인 :
             Adyear     Grade
count     5.000000  5.000000
mean   2018.000000  3.600000
std       1.581139  0.556776
min    2016.000000  2.900000
25%    2017.000000  3.200000
50%    2018.000000  3.700000
75%    2019.000000  3.900000
max    2020.000000  4.300000

4) 성명순으로 정렬

In [76]:
sort_name=df.sort_values(by="Name")
display(sort_name)

   Name  Adyear  Grade Sex
5  Choi    2020    3.9   M
3  Jung    2019    3.2   F
2   Kim    2018    3.7   M
4   Kim    2016    2.9   F
1   Lee    2017    4.3   F

### 실습 3. 데이터프레임 인덱싱 연습

5명의 성적 데이터 이용   
1)성명만 추출  
2)입학년도와 성적만 추출  
3)성명이 'kim'인 데이터만 추출  
4)입학년도가 2018년도 이상만 추출  
5)여성만 추출  
6)여성이면서 입학년도가 2019년도만 추출  
7)성적이 3.5이상이거나 남성인 경우 추출

In [77]:
grade=['1','2','3','4','5']
df=pd.DataFrame({"Name": pd.Series(['Lee','Kim','Jung','Kim','Choi']),
                "Adyear":pd.Series([2017,2018,2019,2016,2020]),
                "Grade":pd.Series([4.3,3.7,3.2,2.9,3.9]),
                "Sex":pd.Series(['F','M','F','F','M'])})
df.index=grade
display(df)

   Name  Adyear  Grade Sex
1   Lee    2017    4.3   F
2   Kim    2018    3.7   M
3  Jung    2019    3.2   F
4   Kim    2016    2.9   F
5  Choi    2020    3.9   M

1) 성명만 추출

In [78]:
display("성명만 추출",df[["Name"]])

'성명만 추출'

   Name
1   Lee
2   Kim
3  Jung
4   Kim
5  Choi

2) 입학년도와 성적만 추출

In [79]:
display("입학년도와 성적만 추출",df[["Adyear","Grade"]])

'입학년도와 성적만 추출'

   Adyear  Grade
1    2017    4.3
2    2018    3.7
3    2019    3.2
4    2016    2.9
5    2020    3.9

3) 성명이 'kim'인 데이터만 추출

In [80]:
display("성명이 'kim'인 데이터만 추출",df[(df.Name)=="Kim"])

"성명이 'kim'인 데이터만 추출"

  Name  Adyear  Grade Sex
2  Kim    2018    3.7   M
4  Kim    2016    2.9   F

4) 입학년도가 2018년도 이상만 추출

In [81]:
display("입학년도가 2018년도 이상만 추출",df[(df.Adyear)>=2018])

'입학년도가 2018년도 이상만 추출'

   Name  Adyear  Grade Sex
2   Kim    2018    3.7   M
3  Jung    2019    3.2   F
5  Choi    2020    3.9   M

5) 여성만 추출

In [82]:
display("여성만 추출",df[(df.Sex)=="F"])

'여성만 추출'

   Name  Adyear  Grade Sex
1   Lee    2017    4.3   F
3  Jung    2019    3.2   F
4   Kim    2016    2.9   F

6) 여성이면서 입학년도가 2019년도만 추출

In [85]:
display("여성이면서 입학년도가 2019년도만 추출",
        df[((df.Sex)=="F") & (df.Adyear==2019)])

'여성이면서 입학년도가 2019년도만 추출'

   Name  Adyear  Grade Sex
3  Jung    2019    3.2   F

7) 성적이 3.5이상이거나 남성인 경우 추출

In [86]:
display("성적이 3.5이상이거나 남성인 경우 추출",
        df[((df.Sex)=="M") & (df.Grade>=3.5)])

'성적이 3.5이상이거나 남성인 경우 추출'

   Name  Adyear  Grade Sex
2   Kim    2018    3.7   M
5  Choi    2020    3.9   M